In [7]:
import pandas as pd
import numpy as np
import seaborn as sns
import ast, json

from datetime import datetime
import matplotlib.pyplot as plt
%matplotlib inline

In [8]:
data = pd.read_csv("Data/teaching_training_data.csv")
cft = pd.read_csv("Data/teaching_training_data_cft.csv", usecols=["unid", "cft_score"])
com = pd.read_csv("Data/teaching_training_data_com.csv", usecols=["unid", "com_score"])
grit = pd.read_csv("Data/teaching_training_data_grit.csv", usecols=["unid", "grit_score"])
num = pd.read_csv("Data/teaching_training_data_num.csv", usecols=["unid", "num_score"])
opt = pd.read_csv("Data/teaching_training_data_opt.csv", usecols=["unid", "opt_score"])
data.head()

,Unnamed: 0,unid,survey_date_month,survey_num,gender,dob,province,working,job_start_date,job_leave_date,...,leadershiprole,peoplelive,peoplelive_15plus,numchildren,numearnincome,anygrant,anyhhincome,financial_situation_now,financial_situation_5years,givemoney_yes
0,1,41964,2018-06-01,1,Female,1992-02-01,NaN,True,2018-06-01,NaN,...,NaN,NaN,NaN,NaN,NaN,False,False,NaN,NaN,NaN
1,2,41964,2018-11-01,2,Female,1992-02-01,NaN,True,2018-04-30,2018-11-08,...,NaN,NaN,NaN,NaN,NaN,False,False,NaN,NaN,NaN
2,3,15241,2016-03-01,1,Female,1988-11-01,NaN,True,2015-03-01,2016-03-15,...,No,2,NaN,3,1,True,True,2,8,False
3,4,33702,2016-04-01,1,Male,1991-04-01,NaN,True,2016-02-01,2016-04-14,...,No,4,NaN,1,1,False,True,1 (Worst possible financial situation),1 (Worst possible financial situation),False
4,5,33702,2016-08-01,2,Male,1991-04-01,NaN,False,NaN,NaN,...,No,4,NaN,1,1,False,True,1 (Worst possible financial situation),1 (Worst possible financial situation),False

In [9]:
data.dtypes

Unnamed: 0                     int64
unid                           int64
survey_date_month             object
survey_num                     int64
gender                        object
dob                           object
province                      object
working                         bool
job_start_date                object
job_leave_date                object
company_size                  object
monthly_pay                   object
volunteer                     object
leadershiprole                object
peoplelive                    object
peoplelive_15plus             object
numchildren                   object
numearnincome                 object
anygrant                      object
anyhhincome                   object
financial_situation_now       object
financial_situation_5years    object
givemoney_yes                 object
dtype: object

In [10]:
data.apply('nunique')

Unnamed: 0                    83270
unid                          51262
survey_date_month                34
survey_num                        9
gender                            2
dob                             274
province                          9
working                           2
job_start_date                  160
job_leave_date                  851
company_size                      2
monthly_pay                      11
volunteer                         2
leadershiprole                    2
peoplelive                       21
peoplelive_15plus                17
numchildren                       6
numearnincome                    16
anygrant                          2
anyhhincome                       2
financial_situation_now          10
financial_situation_5years       10
givemoney_yes                     2
dtype: int64

In [11]:
columns_to_drop = ["job_start_date","job_leave_date","leadershiprole","peoplelive"
                   ,"peoplelive_15plus","numchildren","anygrant","anyhhincome"
                   ,"financial_situation_5years"
                   ,"givemoney_yes","province","dob"]
data = data.drop(columns_to_drop, axis=1)
data.head()
#i didnt think that those rows were relevant to our question but if we want to keep some then cool.

,Unnamed: 0,unid,survey_date_month,survey_num,gender,working,company_size,monthly_pay,volunteer,numearnincome,financial_situation_now
0,1,41964,2018-06-01,1,Female,True,More than 200 employees,Between R2001 and 3000,NaN,NaN,NaN
1,2,41964,2018-11-01,2,Female,True,NaN,NaN,NaN,NaN,NaN
2,3,15241,2016-03-01,1,Female,True,NaN,NaN,No,1,2
3,4,33702,2016-04-01,1,Male,True,NaN,NaN,Yes,1,1 (Worst possible financial situation)
4,5,33702,2016-08-01,2,Male,False,NaN,NaN,Yes,1,1 (Worst possible financial situation)

In [12]:
data.head()

,Unnamed: 0,unid,survey_date_month,survey_num,gender,working,company_size,monthly_pay,volunteer,numearnincome,financial_situation_now
0,1,41964,2018-06-01,1,Female,True,More than 200 employees,Between R2001 and 3000,NaN,NaN,NaN
1,2,41964,2018-11-01,2,Female,True,NaN,NaN,NaN,NaN,NaN
2,3,15241,2016-03-01,1,Female,True,NaN,NaN,No,1,2
3,4,33702,2016-04-01,1,Male,True,NaN,NaN,Yes,1,1 (Worst possible financial situation)
4,5,33702,2016-08-01,2,Male,False,NaN,NaN,Yes,1,1 (Worst possible financial situation)

In [13]:
columns_2_drop = ["Unnamed: 0","company_size","monthly_pay","volunteer","numearnincome"]
data = data.drop(columns_2_drop, axis=1)
data.head()

,unid,survey_date_month,survey_num,gender,working,financial_situation_now
0,41964,2018-06-01,1,Female,True,NaN
1,41964,2018-11-01,2,Female,True,NaN
2,15241,2016-03-01,1,Female,True,2
3,33702,2016-04-01,1,Male,True,1 (Worst possible financial situation)
4,33702,2016-08-01,2,Male,False,1 (Worst possible financial situation)

In [14]:
data.shape

(83270, 6)

In [15]:
cft_max = cft.groupby('unid')['cft_score'].max().to_frame()
cft_max

        cft_score
unid
130             4
147             6
156             3
157             7
158             4
...           ...
102486          6
102503          6
102504          3
102505          6
102516          8

[32880 rows x 1 columns]

In [16]:
data.replace({"1 (Worst possible financial situation)": 1, "2": 2, "3": 3, "4": 4, "5": 5, "6": 6, "7": 7,
              "8": 8, "9": 9, "10 (Best possible financial situation)": 10, "nan": 0
             }, inplace=True)

In [17]:
data["financial_situation_now"] = data.financial_situation_now.astype(float)

In [18]:
df = pd.merge(data,cft, how = 'outer', on = 'unid')
df = pd.merge(df,num, how = 'outer', on = 'unid')
df = pd.merge(df,com, how = 'outer', on = 'unid')
df = pd.merge(df,grit, how = 'outer', on = 'unid')
df = pd.merge(df,opt, how = 'outer', on = 'unid')
df
#this way by doing 'outer' i have not dropped any rows but created multiple copies, later i get rid of the unneccesary ones.

,unid,survey_date_month,survey_num,gender,working,financial_situation_now,cft_score,num_score,com_score,grit_score,opt_score
0,41964,2018-06-01,1,Female,True,NaN,4.0,NaN,4.0,4,NaN
1,41964,2018-06-01,1,Female,True,NaN,4.0,NaN,4.0,4,NaN
2,41964,2018-06-01,1,Female,True,NaN,4.0,NaN,4.0,9,NaN
3,41964,2018-06-01,1,Female,True,NaN,4.0,NaN,4.0,9,NaN
4,41964,2018-06-01,1,Female,True,NaN,4.0,NaN,4.0,4,NaN
...,...,...,...,...,...,...,...,...,...,...,...
27694471,79971,2017-08-01,3,Female,True,9.0,8.0,5.0,6.0,7,3.0
27694472,79971,2017-08-01,3,Female,True,9.0,8.0,5.0,6.0,7,3.0
27694473,79971,2017-08-01,3,Female,True,9.0,8.0,5.0,6.0,5,-4.0
27694474,79971,2017-08-01,3,Female,True,9.0,8.0,5.0,6.0,5,3.0
27694475,79971,2017-08-01,3,Female,True,9.0,8.0,5.0,6.0,5,3.0

In [19]:
df.shape

(27694476, 11)

In [20]:
df.dtypes

unid                         int64
survey_date_month           object
survey_num                   int64
gender                      object
working                       bool
financial_situation_now    float64
cft_score                  float64
num_score                  float64
com_score                  float64
grit_score                   int64
opt_score                  float64
dtype: object

In [21]:
print(df.isnull().sum())

unid                             0
survey_date_month                0
survey_num                       0
gender                          30
working                          0
financial_situation_now    7058951
cft_score                    82043
num_score                  3789959
com_score                   690967
grit_score                       0
opt_score                  7058951
dtype: int64

In [ ]:
print(df.shape)

# Rows containing duplicate data
duplicate_rows_df = df[df.duplicated()]

print(duplicate_rows_df.shape)

(27694476, 11)

In [ ]:
df_new = df.groupby(df['unid']).aggregate({'gender':'first','working':'last'
                                          ,'num_score':'max','com_score':'max'
                                          ,'cft_score':'max','grit_score':'max'
                                          ,'opt_score':'max', 'financial_situation_now': 'last'})

In [ ]:
 df_new.shape

In [ ]:
df_new.head(15)

In [ ]:
df_new.shape #so we still have all the participants included as the total of unique participants in 51,262.

In [ ]:
df.apply('nunique')

In [ ]:
df_new.describe()

In [ ]:
import missingno as msno

msno.matrix(df_new); #so as we can see, grit is the only thing that everyone seems to have done.

In [ ]:
from ipywidgets import interact, fixed

In [ ]:
def numerical_variable_distribution(df_new, col):
    df_new[col].plot.hist()

In [ ]:
numerical_columns = df_new.select_dtypes(include=[np.number]).columns.tolist()
interact(numerical_variable_distribution, 
         col=numerical_columns, df_new=fixed(df_new));

In [ ]:
plt.plot('grit_score','working', data=df_new)
plt.show()
#obviously this shows us nothing....but it looks awesome. so i'm gonna leave it here

In [ ]:
sns.relplot(x="grit_score", y="cft_score", data=df_new, kind="scatter")

In [ ]:
df_new.dtypes

In [ ]:
sns.pairplot(df_new, hue ='working')

In [ ]:
jp = sns.jointplot("cft_score", "num_score", data=df_new)

In [ ]:
jp = sns.jointplot("opt_score", "grit_score", data=df_new, hue ='working')

In [ ]:
ct_cft = pd.crosstab(df_new.cft_score, df_new.working)
print(ct_cft)

In [ ]:
ct_grit = pd.crosstab(df_new.grit_score, df_new.working)
print(ct_grit)

In [ ]:
ct_opt = pd.crosstab(df_new.opt_score, df_new.working)
print(ct_opt)

In [ ]:
ct_gender = pd.crosstab(df_new.gender, df_new.working)
print(ct_gender)

In [ ]:
ct_com = pd.crosstab(df_new.com_score, df_new.working)
print(ct_com)

In [ ]:
ct_num = pd.crosstab(df_new.num_score, df_new.working)
print(ct_num)

In [ ]:
df_new.corr()

In [ ]:
df_new.dtypes

In [ ]:
df_new['gender']=df_new['gender'].replace(['Female','Male'],[1,0])
df_new['gender']

In [ ]:
df_new['gender']=df_new.astype(np.bool)

In [ ]:
df_new.dtypes

In [ ]:
df_new.corr()

In [ ]:
from sklearn.linear_model import LinearRegression

In [ ]:
tstat, pvalue, ddof = ttest_ind(
                                grit_men,
                                grit_women,
                                alternative="two-sided",
                                usevar="pooled"
)
pvalue